system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       latestTime;      //startTime;      //

startTime       0;

stopAt          endTime;

endTime         28;

deltaT          0.001;

writeControl    timeStep;

writeInterval   10;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

//adjustTimeStep yes;

//maxCo 0.1;

//maxDeltaT 0.00001;
 functions
{

#includeFunc yPlus
#includeFunc wallShearStress
#includeFunc surfaceFieldValue

leftPatch
    {
        type            surfaceFieldValue;
        libs            ("libfieldFunctionObjects.so");
        log             true;
        writeControl    writeTime;
        writeFields     true;
        regionType      patch;
        name            left;
        operation       areaAverage;
        fields
        (
            wallShearStress
            U
        );
    }
///////////////////////////////////////////////////////////////////////////
  /* 
    fieldAverage1
    {
        type            fieldAverage;
        libs            ("libfieldFunctionObjects.so");
        writeControl    writeTime;
 
        fields
        (
            U
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }
        );
    }
}
///////////////////////////////////////////////////////////////////////////
    minmaxdomain
    {
	type fieldMinMax;

	functionObjectLibs ("libfieldFunctionObjects.so");

	enabled true; //true or false

	mode component;

	writeControl timeStep;
	writeInterval 1;

	log true;

	fields (k omega);
    }

///////////////////////////////////////////////////////////////////////////

  yplus
    {
    	type yPlus;
    	functionObjectLibs ("libutilityFunctionObjects.so");
    	enabled true;
        writeControl outputTime;
    }

///////////////////////////////////////////////////////////////////////////
  sets
    {
        type            sets;

        setFormat       raw;

        interpolationScheme cellPointFace;

	writeControl   timeStep;
	writeInterval  40;
        timeStart      18.83;

        fields
        (
            U
        );

        sets
        (
        sc // central set
        {
        //type            lineCellFace;
        //type            midPointAndFace;
        type            lineCell;
        //type            midPoint;
        //type            face;

        //type            uniform;
	//nPoints 	24;
        axis            y;
        start           (.005 0    .005);
        end             (.005 0.1  .005);
        }
        );
    }*/
};

// ************************************************************************* //
