constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    frontAndBackPlanes
    {
        type            empty;
        inGroups        1(empty);
        nFaces          50000;
        startFace       49675;
    }
    left
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          200;
        startFace       99675;
        matchTolerance  0.1;
        transform       translational;
        neighbourPatch  right;
        separationVector (-0.21056 0 0);
    }
    right
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          200;
        startFace       99875;
        matchTolerance  0.1;
        transform       translational;
        neighbourPatch  left;
        separationVector (0.21056 0 0);
    }
    bottomWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          125;
        startFace       100075;
    }
    freeStream
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          125;
        startFace       100200;
    }
)

// ************************************************************************* //
