system/probesDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      probesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type probes;
libs ("libsampling.so");

// Fields to be probed. runTime modifiable!
fields
(   
U
//wallShearStress
);

// Locations to be probed. runTime modifiable!
probeLocations
(
         (0.10486 0.25 0)     // above the ripple_crest;
);
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
